GopalSaraf/Practicals/PSDL/include/proc/pic16f1503.inc
// Register: PWM2DCH
#define PWM2DCH PWM2DCH
PWM2DCH                                  equ 0615h
// bitfield definitions
PWM2DCH_PWM2DCH_POSN                     equ 0000h
PWM2DCH_PWM2DCH_POSITION                 equ 0000h
PWM2DCH_PWM2DCH_SIZE                     equ 0008h
PWM2DCH_PWM2DCH_LENGTH                   equ 0008h
PWM2DCH_PWM2DCH_MASK                     equ 00FFh
PWM2DCH_PWM2DCH0_POSN                    equ 0000h
PWM2DCH_PWM2DCH0_POSITION                equ 0000h
PWM2DCH_PWM2DCH0_SIZE                    equ 0001h
PWM2DCH_PWM2DCH0_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH0_MASK                    equ 0001h
PWM2DCH_PWM2DCH1_POSN                    equ 0001h
PWM2DCH_PWM2DCH1_POSITION                equ 0001h
PWM2DCH_PWM2DCH1_SIZE                    equ 0001h
PWM2DCH_PWM2DCH1_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH1_MASK                    equ 0002h
PWM2DCH_PWM2DCH2_POSN                    equ 0002h
PWM2DCH_PWM2DCH2_POSITION                equ 0002h
PWM2DCH_PWM2DCH2_SIZE                    equ 0001h
PWM2DCH_PWM2DCH2_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH2_MASK                    equ 0004h
PWM2DCH_PWM2DCH3_POSN                    equ 0003h
PWM2DCH_PWM2DCH3_POSITION                equ 0003h
PWM2DCH_PWM2DCH3_SIZE                    equ 0001h
PWM2DCH_PWM2DCH3_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH3_MASK                    equ 0008h
PWM2DCH_PWM2DCH4_POSN                    equ 0004h
PWM2DCH_PWM2DCH4_POSITION                equ 0004h
PWM2DCH_PWM2DCH4_SIZE                    equ 0001h
PWM2DCH_PWM2DCH4_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH4_MASK                    equ 0010h
PWM2DCH_PWM2DCH5_POSN                    equ 0005h
PWM2DCH_PWM2DCH5_POSITION                equ 0005h
PWM2DCH_PWM2DCH5_SIZE                    equ 0001h
PWM2DCH_PWM2DCH5_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH5_MASK                    equ 0020h
PWM2DCH_PWM2DCH6_POSN                    equ 0006h
PWM2DCH_PWM2DCH6_POSITION                equ 0006h
PWM2DCH_PWM2DCH6_SIZE                    equ 0001h
PWM2DCH_PWM2DCH6_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH6_MASK                    equ 0040h
PWM2DCH_PWM2DCH7_POSN                    equ 0007h
PWM2DCH_PWM2DCH7_POSITION                equ 0007h
PWM2DCH_PWM2DCH7_SIZE                    equ 0001h
PWM2DCH_PWM2DCH7_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH7_MASK                    equ 0080h

// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0616h
// bitfield definitions
PWM2CON_PWM2POL_POSN                     equ 0004h
PWM2CON_PWM2POL_POSITION                 equ 0004h
PWM2CON_PWM2POL_SIZE                     equ 0001h
PWM2CON_PWM2POL_LENGTH                   equ 0001h
PWM2CON_PWM2POL_MASK                     equ 0010h
PWM2CON_PWM2OUT_POSN                     equ 0005h
PWM2CON_PWM2OUT_POSITION                 equ 0005h
PWM2CON_PWM2OUT_SIZE                     equ 0001h
PWM2CON_PWM2OUT_LENGTH                   equ 0001h
PWM2CON_PWM2OUT_MASK                     equ 0020h
PWM2CON_PWM2OE_POSN                      equ 0006h
PWM2CON_PWM2OE_POSITION                  equ 0006h
PWM2CON_PWM2OE_SIZE                      equ 0001h
PWM2CON_PWM2OE_LENGTH                    equ 0001h
PWM2CON_PWM2OE_MASK                      equ 0040h
PWM2CON_PWM2EN_POSN                      equ 0007h
PWM2CON_PWM2EN_POSITION                  equ 0007h
PWM2CON_PWM2EN_SIZE                      equ 0001h
PWM2CON_PWM2EN_LENGTH                    equ 0001h
PWM2CON_PWM2EN_MASK                      equ 0080h

// Register: PWM3DCL
#define PWM3DCL PWM3DCL
PWM3DCL                                  equ 0617h
// bitfield definitions
PWM3DCL_PWM3DCL_POSN                     equ 0006h
PWM3DCL_PWM3DCL_POSITION                 equ 0006h
PWM3DCL_PWM3DCL_SIZE                     equ 0002h
PWM3DCL_PWM3DCL_LENGTH                   equ 0002h
PWM3DCL_PWM3DCL_MASK                     equ 00C0h
PWM3DCL_PWM3DCL0_POSN                    equ 0006h
PWM3DCL_PWM3DCL0_POSITION                equ 0006h
PWM3DCL_PWM3DCL0_SIZE                    equ 0001h
PWM3DCL_PWM3DCL0_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL0_MASK                    equ 0040h
PWM3DCL_PWM3DCL1_POSN                    equ 0007h
PWM3DCL_PWM3DCL1_POSITION                equ 0007h
PWM3DCL_PWM3DCL1_SIZE                    equ 0001h
PWM3DCL_PWM3DCL1_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL1_MASK                    equ 0080h

// Register: PWM3DCH
#define PWM3DCH PWM3DCH
PWM3DCH                                  equ 0618h
// bitfield definitions
PWM3DCH_PWM3DCH_POSN                     equ 0000h
PWM3DCH_PWM3DCH_POSITION                 equ 0000h
PWM3DCH_PWM3DCH_SIZE                     equ 0008h
PWM3DCH_PWM3DCH_LENGTH                   equ 0008h
PWM3DCH_PWM3DCH_MASK                     equ 00FFh
PWM3DCH_PWM3DCH0_POSN                    equ 0000h
PWM3DCH_PWM3DCH0_POSITION                equ 0000h
PWM3DCH_PWM3DCH0_SIZE                    equ 0001h
PWM3DCH_PWM3DCH0_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH0_MASK                    equ 0001h
PWM3DCH_PWM3DCH1_POSN                    equ 0001h
PWM3DCH_PWM3DCH1_POSITION                equ 0001h
PWM3DCH_PWM3DCH1_SIZE                    equ 0001h
PWM3DCH_PWM3DCH1_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH1_MASK                    equ 0002h
PWM3DCH_PWM3DCH2_POSN                    equ 0002h
PWM3DCH_PWM3DCH2_POSITION                equ 0002h
PWM3DCH_PWM3DCH2_SIZE                    equ 0001h
PWM3DCH_PWM3DCH2_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH2_MASK                    equ 0004h
PWM3DCH_PWM3DCH3_POSN                    equ 0003h
PWM3DCH_PWM3DCH3_POSITION                equ 0003h
PWM3DCH_PWM3DCH3_SIZE                    equ 0001h
PWM3DCH_PWM3DCH3_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH3_MASK                    equ 0008h
PWM3DCH_PWM3DCH4_POSN                    equ 0004h
PWM3DCH_PWM3DCH4_POSITION                equ 0004h
PWM3DCH_PWM3DCH4_SIZE                    equ 0001h
PWM3DCH_PWM3DCH4_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH4_MASK                    equ 0010h
PWM3DCH_PWM3DCH5_POSN                    equ 0005h
PWM3DCH_PWM3DCH5_POSITION                equ 0005h
PWM3DCH_PWM3DCH5_SIZE                    equ 0001h
PWM3DCH_PWM3DCH5_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH5_MASK                    equ 0020h
PWM3DCH_PWM3DCH6_POSN                    equ 0006h
PWM3DCH_PWM3DCH6_POSITION                equ 0006h
PWM3DCH_PWM3DCH6_SIZE                    equ 0001h
PWM3DCH_PWM3DCH6_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH6_MASK                    equ 0040h
PWM3DCH_PWM3DCH7_POSN                    equ 0007h
PWM3DCH_PWM3DCH7_POSITION                equ 0007h
PWM3DCH_PWM3DCH7_SIZE                    equ 0001h
PWM3DCH_PWM3DCH7_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH7_MASK                    equ 0080h

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0619h
// bitfield definitions
PWM3CON_PWM3POL_POSN                     equ 0004h
PWM3CON_PWM3POL_POSITION                 equ 0004h
PWM3CON_PWM3POL_SIZE                     equ 0001h
PWM3CON_PWM3POL_LENGTH                   equ 0001h
PWM3CON_PWM3POL_MASK                     equ 0010h
PWM3CON_PWM3OUT_POSN                     equ 0005h
PWM3CON_PWM3OUT_POSITION                 equ 0005h
PWM3CON_PWM3OUT_SIZE                     equ 0001h
PWM3CON_PWM3OUT_LENGTH                   equ 0001h
PWM3CON_PWM3OUT_MASK                     equ 0020h
PWM3CON_PWM3OE_POSN                      equ 0006h
PWM3CON_PWM3OE_POSITION                  equ 0006h
PWM3CON_PWM3OE_SIZE                      equ 0001h
PWM3CON_PWM3OE_LENGTH                    equ 0001h
PWM3CON_PWM3OE_MASK                      equ 0040h
PWM3CON_PWM3EN_POSN                      equ 0007h
PWM3CON_PWM3EN_POSITION                  equ 0007h
PWM3CON_PWM3EN_SIZE                      equ 0001h
PWM3CON_PWM3EN_LENGTH                    equ 0001h
PWM3CON_PWM3EN_MASK                      equ 0080h

// Register: PWM4DCL
#define PWM4DCL PWM4DCL
PWM4DCL                                  equ 061Ah
// bitfield definitions
PWM4DCL_PWM4DCL_POSN                     equ 0006h
PWM4DCL_PWM4DCL_POSITION                 equ 0006h
PWM4DCL_PWM4DCL_SIZE                     equ 0002h
PWM4DCL_PWM4DCL_LENGTH                   equ 0002h
PWM4DCL_PWM4DCL_MASK                     equ 00C0h
PWM4DCL_PWM4DCL0_POSN                    equ 0006h
PWM4DCL_PWM4DCL0_POSITION                equ 0006h
PWM4DCL_PWM4DCL0_SIZE                    equ 0001h
PWM4DCL_PWM4DCL0_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL0_MASK                    equ 0040h
PWM4DCL_PWM4DCL1_POSN                    equ 0007h
PWM4DCL_PWM4DCL1_POSITION                equ 0007h
PWM4DCL_PWM4DCL1_SIZE                    equ 0001h
PWM4DCL_PWM4DCL1_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL1_MASK                    equ 0080h

