GopalSaraf/Practicals/PSDL/include/proc/pic16f1503.inc
// Register: PWM4DCH
#define PWM4DCH PWM4DCH
PWM4DCH                                  equ 061Bh
// bitfield definitions
PWM4DCH_PWM4DCH_POSN                     equ 0000h
PWM4DCH_PWM4DCH_POSITION                 equ 0000h
PWM4DCH_PWM4DCH_SIZE                     equ 0008h
PWM4DCH_PWM4DCH_LENGTH                   equ 0008h
PWM4DCH_PWM4DCH_MASK                     equ 00FFh
PWM4DCH_PWM4DCH0_POSN                    equ 0000h
PWM4DCH_PWM4DCH0_POSITION                equ 0000h
PWM4DCH_PWM4DCH0_SIZE                    equ 0001h
PWM4DCH_PWM4DCH0_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH0_MASK                    equ 0001h
PWM4DCH_PWM4DCH1_POSN                    equ 0001h
PWM4DCH_PWM4DCH1_POSITION                equ 0001h
PWM4DCH_PWM4DCH1_SIZE                    equ 0001h
PWM4DCH_PWM4DCH1_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH1_MASK                    equ 0002h
PWM4DCH_PWM4DCH2_POSN                    equ 0002h
PWM4DCH_PWM4DCH2_POSITION                equ 0002h
PWM4DCH_PWM4DCH2_SIZE                    equ 0001h
PWM4DCH_PWM4DCH2_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH2_MASK                    equ 0004h
PWM4DCH_PWM4DCH3_POSN                    equ 0003h
PWM4DCH_PWM4DCH3_POSITION                equ 0003h
PWM4DCH_PWM4DCH3_SIZE                    equ 0001h
PWM4DCH_PWM4DCH3_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH3_MASK                    equ 0008h
PWM4DCH_PWM4DCH4_POSN                    equ 0004h
PWM4DCH_PWM4DCH4_POSITION                equ 0004h
PWM4DCH_PWM4DCH4_SIZE                    equ 0001h
PWM4DCH_PWM4DCH4_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH4_MASK                    equ 0010h
PWM4DCH_PWM4DCH5_POSN                    equ 0005h
PWM4DCH_PWM4DCH5_POSITION                equ 0005h
PWM4DCH_PWM4DCH5_SIZE                    equ 0001h
PWM4DCH_PWM4DCH5_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH5_MASK                    equ 0020h
PWM4DCH_PWM4DCH6_POSN                    equ 0006h
PWM4DCH_PWM4DCH6_POSITION                equ 0006h
PWM4DCH_PWM4DCH6_SIZE                    equ 0001h
PWM4DCH_PWM4DCH6_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH6_MASK                    equ 0040h
PWM4DCH_PWM4DCH7_POSN                    equ 0007h
PWM4DCH_PWM4DCH7_POSITION                equ 0007h
PWM4DCH_PWM4DCH7_SIZE                    equ 0001h
PWM4DCH_PWM4DCH7_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH7_MASK                    equ 0080h

// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 061Ch
// bitfield definitions
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4OE_POSN                      equ 0006h
PWM4CON_PWM4OE_POSITION                  equ 0006h
PWM4CON_PWM4OE_SIZE                      equ 0001h
PWM4CON_PWM4OE_LENGTH                    equ 0001h
PWM4CON_PWM4OE_MASK                      equ 0040h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
CWG1DBR                                  equ 0691h
// bitfield definitions
CWG1DBR_CWG1DBR_POSN                     equ 0000h
CWG1DBR_CWG1DBR_POSITION                 equ 0000h
CWG1DBR_CWG1DBR_SIZE                     equ 0006h
CWG1DBR_CWG1DBR_LENGTH                   equ 0006h
CWG1DBR_CWG1DBR_MASK                     equ 003Fh
CWG1DBR_CWG1DBR0_POSN                    equ 0000h
CWG1DBR_CWG1DBR0_POSITION                equ 0000h
CWG1DBR_CWG1DBR0_SIZE                    equ 0001h
CWG1DBR_CWG1DBR0_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR0_MASK                    equ 0001h
CWG1DBR_CWG1DBR1_POSN                    equ 0001h
CWG1DBR_CWG1DBR1_POSITION                equ 0001h
CWG1DBR_CWG1DBR1_SIZE                    equ 0001h
CWG1DBR_CWG1DBR1_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR1_MASK                    equ 0002h
CWG1DBR_CWG1DBR2_POSN                    equ 0002h
CWG1DBR_CWG1DBR2_POSITION                equ 0002h
CWG1DBR_CWG1DBR2_SIZE                    equ 0001h
CWG1DBR_CWG1DBR2_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR2_MASK                    equ 0004h
CWG1DBR_CWG1DBR3_POSN                    equ 0003h
CWG1DBR_CWG1DBR3_POSITION                equ 0003h
CWG1DBR_CWG1DBR3_SIZE                    equ 0001h
CWG1DBR_CWG1DBR3_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR3_MASK                    equ 0008h
CWG1DBR_CWG1DBR4_POSN                    equ 0004h
CWG1DBR_CWG1DBR4_POSITION                equ 0004h
CWG1DBR_CWG1DBR4_SIZE                    equ 0001h
CWG1DBR_CWG1DBR4_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR4_MASK                    equ 0010h
CWG1DBR_CWG1DBR5_POSN                    equ 0005h
CWG1DBR_CWG1DBR5_POSITION                equ 0005h
CWG1DBR_CWG1DBR5_SIZE                    equ 0001h
CWG1DBR_CWG1DBR5_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR5_MASK                    equ 0020h

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
CWG1DBF                                  equ 0692h
// bitfield definitions
CWG1DBF_CWG1DBF_POSN                     equ 0000h
CWG1DBF_CWG1DBF_POSITION                 equ 0000h
CWG1DBF_CWG1DBF_SIZE                     equ 0006h
CWG1DBF_CWG1DBF_LENGTH                   equ 0006h
CWG1DBF_CWG1DBF_MASK                     equ 003Fh
CWG1DBF_CWG1DBF0_POSN                    equ 0000h
CWG1DBF_CWG1DBF0_POSITION                equ 0000h
CWG1DBF_CWG1DBF0_SIZE                    equ 0001h
CWG1DBF_CWG1DBF0_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF0_MASK                    equ 0001h
CWG1DBF_CWG1DBF1_POSN                    equ 0001h
CWG1DBF_CWG1DBF1_POSITION                equ 0001h
CWG1DBF_CWG1DBF1_SIZE                    equ 0001h
CWG1DBF_CWG1DBF1_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF1_MASK                    equ 0002h
CWG1DBF_CWG1DBF2_POSN                    equ 0002h
CWG1DBF_CWG1DBF2_POSITION                equ 0002h
CWG1DBF_CWG1DBF2_SIZE                    equ 0001h
CWG1DBF_CWG1DBF2_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF2_MASK                    equ 0004h
CWG1DBF_CWG1DBF3_POSN                    equ 0003h
CWG1DBF_CWG1DBF3_POSITION                equ 0003h
CWG1DBF_CWG1DBF3_SIZE                    equ 0001h
CWG1DBF_CWG1DBF3_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF3_MASK                    equ 0008h
CWG1DBF_CWG1DBF4_POSN                    equ 0004h
CWG1DBF_CWG1DBF4_POSITION                equ 0004h
CWG1DBF_CWG1DBF4_SIZE                    equ 0001h
CWG1DBF_CWG1DBF4_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF4_MASK                    equ 0010h
CWG1DBF_CWG1DBF5_POSN                    equ 0005h
CWG1DBF_CWG1DBF5_POSITION                equ 0005h
CWG1DBF_CWG1DBF5_SIZE                    equ 0001h
CWG1DBF_CWG1DBF5_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF5_MASK                    equ 0020h

